tutorials/verificationAndValidation/turbulentInflow/constant/turbulenceProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1906                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      turbulenceProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

simulationType LES;

LES
{
    turbulence      on;

    LESModel        Smagorinsky;
    SmagorinskyCoeffs
    {
        Ce              1.05;
        Ck              0.0266; // Updated to give Cs = 0.065
    }

    printCoeffs     on;

    delta           vanDriest;

    vanDriestCoeffs
    {
        delta           cubeRootVol;
        cubeRootVolCoeffs
        {
            deltaCoeff      2;
        }
        Aplus           26;
        Cdelta          0.158;
    }
}


// ************************************************************************* //
